<?php

$students = [
    "judy" => [
        "國文" => 95,
        "英文" => 64,
        "數學" => 70,
        "地理" => 90,
        "歷史" => 84
    ],
    "amo" => [
        "國文" => 88,
        "英文" => 78,
        "數學" => 54,
        "地理" => 81,
        "歷史" => 71
    ],
    "john" => [
        "國文" => 45,
        "英文" => 60,
        "數學" => 68,
        "地理" => 70,
        "歷史" => 62
    ],
    "peter" => [
        "國文" => 59,
        "英文" => 32,
        "數學" => 77,
        "地理" => 54,
        "歷史" => 42
    ],
    "hebe" => [
        "國文" => 71,
        "英文" => 62,
        "數學" => 80,
        "地理" => 62,
        "歷史" => 64
    ]
];

foreach ($students as $name => $subjects) {
    echo $name . "：<br>";
    foreach ($subjects as $subject => $score) {
        echo $subject . "：" . $score . "分<br>";
    }
    echo "<br>"; // 每個學生之間空一行
}

?>